### Pivot Table
    엑셀에서 pivot table 기능이 있는것처럼, 
    Pandas에서도 이와 유사한 pivot_table함수를 제공한다.
    
    분석을 하다 보면 원본 데이터의 구조가 분석 기법에 맞지 않아서 
    행과 열의 위치를 바꾼다거나, 특정 요인에 따라 집계를 해서 구조를 
    바꿔주어야 하는 경우가 종종 발생하는데 이때 피봇함수를 이용해서
    분석에 알맞는 구조로 데이타를 변경해서 사용한다.

    피봇함수은 DataFrame의 데이타를 Reshape 하는 방법중 하나이다.
    
    여러 컬럼을 index, values, columns 값으로 사용가능하다.
    그룹연산과 함께 사용

#### Reshaping Data By Pivoting( 데이타의 재구조화 )

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt

In [2]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}

df1 = DataFrame(data)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [3]:
df1.pivot_table?

In [11]:
#index, columns, values 매개변수..키워드 매개변수
#df1.pivot_table(index=['도시'],columns=['연도'], values=['인구'])
#df1.pivot_table(index=['도시'],columns=['연도'], '인구')
#df1.pivot_table('인구',index=['도시'],columns=['연도'] )
#df1.pivot_table('인구','도시','연도' )


df1.pivot_table('인구','도시','연도' ,margins=True)

연도        2005       2010       2015           All
도시
부산   3512547.0  3393191.0  3448737.0  3.451492e+06
서울   9762546.0  9631482.0  9904312.0  9.766113e+06
인천         NaN   263203.0  2890451.0  1.576827e+06
All  6637546.5  4429292.0  5414500.0  5.350809e+06

In [12]:
df1['인구'].mean()

5350808.625

In [13]:
df1.pivot_table('인구', index=['연도','도시']) #위와 동일한 결과 도출된다.!!

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

In [14]:
df1.groupby(['연도','도시'])[['인구']].mean()

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

#### 실전데이터

In [15]:
tipdf = pd.read_csv('../data/tips.csv')
tipdf.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner   2.0

In [ ]:
'''
해당 데이타 분석의 목표는 식사총대금 대비 팁의 비율이 어떤 경우에 가장 높은지 찾는 것이다.
우선 식사대금과 팁의 비율을 나타내는 tip_pct컬럼을 하나 추가하자
'''
tipdf['tip_pct'] = round(tipdf['tip']/ tipdf['total_bill'],2)
tipdf.tail()

tipdf.dropna(inplace = True)
tipdf.tail()